Учет_работы/src/Reports/ДеньгиПолученные/ДеньгиПолученные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДеньгиПолученные</name>
  <attributes>
    <name>ЗаПериод</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>работа</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </attributes>
</mdclass:Report>

Учет_работы/src/AccumulationRegisters/ДенежныйОборот/ДенежныйОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныйОборот</name>
  <resources>
    <name>ОплаченнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Работы</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учет_работы/src/Reports/ДеньгиПолученные/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	Об = РеквизитФормыВЗначение("Отчет");
	Макет = Об.ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ДатаН = Формат(ЗаПериод.ДатаНачала,"ДЛФ=Д");
	ОбластьШапка.Параметры.ДатаК = Формат(ЗаПериод.ДатаОкончания,"ДЛФ=Д");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьГод = Макет.ПолучитьОбласть("ПериодГод");
	ОбластьМесяц = Макет.ПолучитьОбласть("ПериодМесяц");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	ТабДок.Очистить();
	
	ТабДок.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ГОД(ДенежныйОборот.ДатаОплаты) КАК ПериодГод,
	|	НАЧАЛОПЕРИОДА(ДенежныйОборот.ДатаОплаты, МЕСЯЦ) КАК ПериодМесяц,
	|	ДенежныйОборот.Период КАК Период,
	|	ДенежныйОборот.ДатаОплаты КАК ДатаОплаты,
	|	ДенежныйОборот.Регистратор КАК Регистратор,
	|	ДенежныйОборот.НомерСтроки КАК НомерСтроки,
	|	ДенежныйОборот.Активность КАК Активность,
	|	ДенежныйОборот.ВидДвижения КАК ВидДвижения,
	|	ДенежныйОборот.Работы КАК Работы,
	|	ДенежныйОборот.Заказчик КАК Заказчик,
	|	ДенежныйОборот.ОплаченнаяСумма КАК ОплаченнаяСумма,
	|	ДенежныйОборот.МоментВремени КАК МоментВремени,
	|	МЕСЯЦ(ДенежныйОборот.ДатаОплаты) КАК МесяцГода,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(ДенежныйОборот.ДатаОплаты) = 1
	|			ТОГДА ""Январь""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.ДатаОплаты) = 2
	|			ТОГДА ""Февраль""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.ДатаОплаты) = 3
	|			ТОГДА ""Март""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.ДатаОплаты) = 4
	|			ТОГДА ""Апрель""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.ДатаОплаты) = 5
	|			ТОГДА ""Май""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.ДатаОплаты) = 6
	|			ТОГДА ""Июнь""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.ДатаОплаты) = 7
	|			ТОГДА ""Июль""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.ДатаОплаты) = 8
	|			ТОГДА ""Август""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.ДатаОплаты) = 9
	|			ТОГДА ""Сентябрь""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.ДатаОплаты) = 10
	|			ТОГДА ""Октябрь""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.ДатаОплаты) = 11
	|			ТОГДА ""Ноябрь""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.ДатаОплаты) = 12
	|			ТОГДА ""Декабрь""
	|	КОНЕЦ КАК МесяцПрописью
	|ИЗ
	|	РегистрНакопления.ДенежныйОборот КАК ДенежныйОборот
	|ГДЕ
	|	ДенежныйОборот.Активность"+?(Не ЗначениеЗаполнено(ЗаПериод),""," И ДенежныйОборот.ДатаОплаты МЕЖДУ &ДатаН И &ДатаК")+"
	|"+?(Не ЗначениеЗаполнено(Заказчик),"","И ДенежныйОборот.Заказчик = &Заказчик")+"
	|"+?(Не ЗначениеЗаполнено(Работа),"","И ДенежныйОборот.Работы = &Работа")+"
	
	| УПОРЯДОЧИТЬ ПО
	
	|МесяцГода,
	|ПериодГод,
	|ПериодМесяц,
	|ДатаОплаты
		
	
	|ИТОГИ
	|	СУММА(ОплаченнаяСумма) 
	
	|ПО
	|	ПериодГод,
	|	МесяцПрописью"; 
	
	Запрос.УстановитьПараметр("ДатаН",ЗаПериод.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаК",ЗаПериод.ДатаОкончания);
	Запрос.УстановитьПараметр("Заказчик",Заказчик);
	Запрос.УстановитьПараметр("Работа",Работа);
	ИтоговаяСумма = 0;
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.НачатьАвтогруппировкуСтрок();
	ВыборкаГод = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаГод.Следующий() цикл
		СтрокаДаты = Строка(ВыборкаГод.ПериодГод);
		СтрокаЗамены = СтрЗаменить(СтрокаДаты,Символы.НПП,"");
		ОбластьГод.Параметры.ПериодГод = СтрокаЗамены+" год";
		ОбластьГод.Параметры.Сумма = ВыборкаГод.ОплаченнаяСумма;
		ВыборкаМесяц = ВыборкаГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ТабДок.Вывести(ОбластьГод,ВыборкаГод.Уровень());
		Пока ВыборкаМесяц.Следующий() цикл
			ОбластьМесяц.параметры.Заполнить(ВыборкаМесяц);
			ВыборкаСтрока = ВыборкаМесяц.Выбрать();
			
			ТабДок.Вывести(ОбластьМесяц,ВыборкаМесяц.Уровень());
			Пока ВыборкаСтрока.Следующий() цикл
				ИтоговаяСумма = ИтоговаяСумма + ВыборкаСтрока.ОплаченнаяСумма;
				ОбластьСтрока.параметры.Заполнить(ВыборкаСтрока);
				
				ТабДок.Вывести(ОбластьСтрока,ВыборкаСтрока.Уровень());
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ОбластьИтог.Параметры.ИтоговаяСумма = ИтоговаяСумма;
	ТабДок.Вывести(ОбластьИтог);	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
